app/Controllers/UserController.php

    public function fetchAll() {
        $model = new UserModel();
        $users = $model->findAll();
---
SELECT *
FROM `users`

    public function edit($id) {
        $model = new UserModel();
        $user = $model->find($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '8'

    public function delete($id) {
        $model = new UserModel();

        if ($model->find($id)) {
            $model->delete($id);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '8'
DELETE FROM `users`
WHERE `id` IN ('8')